0000000
0000001
000000x
0000010
0000011
000001x
00000x0
00000x1
00000xx
0000100
0000101
000010x
0000110
0000111
000011x
00001x0
00001x1
00001xx
0000x00
0000x01
0000x0x
0000x10
0000x11
0000x1x
0000xx0
0000xx1
0000xxx
0001000
0001001
000100x
0001010
0001011
000101x
00010x0
00010x1
00010xx
0001100
0001101
000110x
0001110
0001111
000111x
00011x0
00011x1
00011xx
0001x00
0001x01
0001x0x
0001x10
0001x11
0001x1x
0001xx0
0001xx1
0001xxx
000x000
000x001
000x00x
000x010
000x011
000x01x
000x0x0
000x0x1
000x0xx
000x100
000x101
000x10x
000x110
000x111
000x11x
000x1x0
000x1x1
000x1xx
000xx00
000xx01
000xx0x
000xx10
000xx11
000xx1x
000xxx0
000xxx1
000xxxx
0010000
0010001
001000x
0010010
0010011
001001x
00100x0
00100x1
00100xx
0010100
0010101
001010x
0010110
0010111
001011x
00101x0
00101x1
00101xx
0010x00
0010x01
0010x0x
0010x10
0010x11
0010x1x
0010xx0
0010xx1
0010xxx
0011000
0011001
001100x
0011010
0011011
001101x
00110x0
00110x1
00110xx
0011100
0011101
001110x
0011110
0011111
001111x
00111x0
00111x1
00111xx
0011x00
0011x01
0011x0x
0011x10
0011x11
0011x1x
0011xx0
0011xx1
0011xxx
001x000
001x001
001x00x
001x010
001x011
001x01x
001x0x0
001x0x1
001x0xx
001x100
001x101
001x10x
001x110
001x111
001x11x
001x1x0
001x1x1
001x1xx
001xx00
001xx01
001xx0x
001xx10
001xx11
001xx1x
001xxx0
001xxx1
001xxxx
00x0000
00x0001
00x000x
00x0010
00x0011
00x001x
00x00x0
00x00x1
00x00xx
00x0100
00x0101
00x010x
00x0110
00x0111
00x011x
00x01x0
00x01x1
00x01xx
00x0x00
00x0x01
00x0x0x
00x0x10
00x0x11
00x0x1x
00x0xx0
00x0xx1
00x0xxx
00x1000
00x1001
00x100x
00x1010
00x1011
00x101x
00x10x0
00x10x1
00x10xx
00x1100
00x1101
00x110x
00x1110
00x1111
00x111x
00x11x0
00x11x1
00x11xx
00x1x00
00x1x01
00x1x0x
00x1x10
00x1x11
00x1x1x
00x1xx0
00x1xx1
00x1xxx
00xx000
00xx001
00xx00x
00xx010
00xx011
00xx01x
00xx0x0
00xx0x1
00xx0xx
00xx100
00xx101
00xx10x
00xx110
00xx111
00xx11x
00xx1x0
00xx1x1
00xx1xx
00xxx00
00xxx01
00xxx0x
00xxx10
00xxx11
00xxx1x
00xxxx0
00xxxx1
00xxxxx
0100000
0100001
010000x
0100010
0100011
010001x
01000x0
01000x1
01000xx
0100100
0100101
010010x
0100110
0100111
010011x
01001x0
01001x1
01001xx
0100x00
0100x01
0100x0x
0100x10
0100x11
0100x1x
0100xx0
0100xx1
0100xxx
0101000
0101001
010100x
0101010
0101011
010101x
01010x0
01010x1
01010xx
0101100
0101101
010110x
0101110
0101111
010111x
01011x0
01011x1
01011xx
0101x00
0101x01
0101x0x
0101x10
0101x11
0101x1x
0101xx0
0101xx1
0101xxx
010x000
010x001
010x00x
010x010
010x011
010x01x
010x0x0
010x0x1
010x0xx
010x100
010x101
010x10x
010x110
010x111
010x11x
010x1x0
010x1x1
010x1xx
010xx00
010xx01
010xx0x
010xx10
010xx11
010xx1x
010xxx0
010xxx1
010xxxx
0110000
0110001
011000x
0110010
0110011
011001x
01100x0
01100x1
01100xx
0110100
0110101
011010x
0110110
0110111
011011x
01101x0
01101x1
01101xx
0110x00
0110x01
0110x0x
0110x10
0110x11
0110x1x
0110xx0
0110xx1
0110xxx
0111000
0111001
011100x
0111010
0111011
011101x
01110x0
01110x1
01110xx
0111100
0111101
011110x
0111110
0111111
011111x
01111x0
01111x1
01111xx
0111x00
0111x01
0111x0x
0111x10
0111x11
0111x1x
0111xx0
0111xx1
0111xxx
011x000
011x001
011x00x
011x010
011x011
011x01x
011x0x0
011x0x1
011x0xx
011x100
011x101
011x10x
011x110
011x111
011x11x
011x1x0
011x1x1
011x1xx
011xx00
011xx01
011xx0x
011xx10
011xx11
011xx1x
011xxx0
011xxx1
011xxxx
01x0000
01x0001
01x000x
01x0010
01x0011
01x001x
01x00x0
01x00x1
01x00xx
01x0100
01x0101
01x010x
01x0110
01x0111
01x011x
01x01x0
01x01x1
01x01xx
01x0x00
01x0x01
01x0x0x
01x0x10
01x0x11
01x0x1x
01x0xx0
01x0xx1
01x0xxx
01x1000
01x1001
01x100x
01x1010
01x1011
01x101x
01x10x0
01x10x1
01x10xx
01x1100
01x1101
01x110x
01x1110
01x1111
01x111x
01x11x0
01x11x1
01x11xx
01x1x00
01x1x01
01x1x0x
01x1x10
01x1x11
01x1x1x
01x1xx0
01x1xx1
01x1xxx
01xx000
01xx001
01xx00x
01xx010
01xx011
01xx01x
01xx0x0
01xx0x1
01xx0xx
01xx100
01xx101
01xx10x
01xx110
01xx111
01xx11x
01xx1x0
01xx1x1
01xx1xx
01xxx00
01xxx01
01xxx0x
01xxx10
01xxx11
01xxx1x
01xxxx0
01xxxx1
01xxxxx
0x00000
0x00001
0x0000x
0x00010
0x00011
0x0001x
0x000x0
0x000x1
0x000xx
0x00100
0x00101
0x0010x
0x00110
0x00111
0x0011x
0x001x0
0x001x1
0x001xx
0x00x00
0x00x01
0x00x0x
0x00x10
0x00x11
0x00x1x
0x00xx0
0x00xx1
0x00xxx
0x01000
0x01001
0x0100x
0x01010
0x01011
0x0101x
0x010x0
0x010x1
0x010xx
0x01100
0x01101
0x0110x
0x01110
0x01111
0x0111x
0x011x0
0x011x1
0x011xx
0x01x00
0x01x01
0x01x0x
0x01x10
0x01x11
0x01x1x
0x01xx0
0x01xx1
0x01xxx
0x0x000
0x0x001
0x0x00x
0x0x010
0x0x011
0x0x01x
0x0x0x0
0x0x0x1
0x0x0xx
0x0x100
0x0x101
0x0x10x
0x0x110
0x0x111
0x0x11x
0x0x1x0
0x0x1x1
0x0x1xx
0x0xx00
0x0xx01
0x0xx0x
0x0xx10
0x0xx11
0x0xx1x
0x0xxx0
0x0xxx1
0x0xxxx
0x10000
0x10001
0x1000x
0x10010
0x10011
0x1001x
0x100x0
0x100x1
0x100xx
0x10100
0x10101
0x1010x
0x10110
0x10111
0x1011x
0x101x0
0x101x1
0x101xx
0x10x00
0x10x01
0x10x0x
0x10x10
0x10x11
0x10x1x
0x10xx0
0x10xx1
0x10xxx
0x11000
0x11001
0x1100x
0x11010
0x11011
0x1101x
0x110x0
0x110x1
0x110xx
0x11100
0x11101
0x1110x
0x11110
0x11111
0x1111x
0x111x0
0x111x1
0x111xx
0x11x00
0x11x01
0x11x0x
0x11x10
0x11x11
0x11x1x
0x11xx0
0x11xx1
0x11xxx
0x1x000
0x1x001
0x1x00x
0x1x010
0x1x011
0x1x01x
0x1x0x0
0x1x0x1
0x1x0xx
0x1x100
0x1x101
0x1x10x
0x1x110
0x1x111
0x1x11x
0x1x1x0
0x1x1x1
0x1x1xx
0x1xx00
0x1xx01
0x1xx0x
0x1xx10
0x1xx11
0x1xx1x
0x1xxx0
0x1xxx1
0x1xxxx
0xx0000
0xx0001
0xx000x
0xx0010
0xx0011
0xx001x
0xx00x0
0xx00x1
0xx00xx
0xx0100
0xx0101
0xx010x
0xx0110
0xx0111
0xx011x
0xx01x0
0xx01x1
0xx01xx
0xx0x00
0xx0x01
0xx0x0x
0xx0x10
0xx0x11
0xx0x1x
0xx0xx0
0xx0xx1
0xx0xxx
0xx1000
0xx1001
0xx100x
0xx1010
0xx1011
0xx101x
0xx10x0
0xx10x1
0xx10xx
0xx1100
0xx1101
0xx110x
0xx1110
0xx1111
0xx111x
0xx11x0
0xx11x1
0xx11xx
0xx1x00
0xx1x01
0xx1x0x
0xx1x10
0xx1x11
0xx1x1x
0xx1xx0
0xx1xx1
0xx1xxx
0xxx000
0xxx001
0xxx00x
0xxx010
0xxx011
0xxx01x
0xxx0x0
0xxx0x1
0xxx0xx
0xxx100
0xxx101
0xxx10x
0xxx110
0xxx111
0xxx11x
0xxx1x0
0xxx1x1
0xxx1xx
0xxxx00
0xxxx01
0xxxx0x
0xxxx10
0xxxx11
0xxxx1x
0xxxxx0
0xxxxx1
0xxxxxx
1000000
1000001
100000x
1000010
1000011
100001x
10000x0
10000x1
10000xx
1000100
1000101
100010x
1000110
1000111
100011x
10001x0
10001x1
10001xx
1000x00
1000x01
1000x0x
1000x10
1000x11
1000x1x
1000xx0
1000xx1
1000xxx
1001000
1001001
100100x
1001010
1001011
100101x
10010x0
10010x1
10010xx
1001100
1001101
100110x
1001110
1001111
100111x
10011x0
10011x1
10011xx
1001x00
1001x01
1001x0x
1001x10
1001x11
1001x1x
1001xx0
1001xx1
1001xxx
100x000
100x001
100x00x
100x010
100x011
100x01x
100x0x0
100x0x1
100x0xx
100x100
100x101
100x10x
100x110
100x111
100x11x
100x1x0
100x1x1
100x1xx
100xx00
100xx01
100xx0x
100xx10
100xx11
100xx1x
100xxx0
100xxx1
100xxxx
1010000
1010001
101000x
1010010
1010011
101001x
10100x0
10100x1
10100xx
1010100
1010101
101010x
1010110
1010111
101011x
10101x0
10101x1
10101xx
1010x00
1010x01
1010x0x
1010x10
1010x11
1010x1x
1010xx0
1010xx1
1010xxx
1011000
1011001
101100x
1011010
1011011
101101x
10110x0
10110x1
10110xx
1011100
1011101
101110x
1011110
1011111
101111x
10111x0
10111x1
10111xx
1011x00
1011x01
1011x0x
1011x10
1011x11
1011x1x
1011xx0
1011xx1
1011xxx
101x000
101x001
101x00x
101x010
101x011
101x01x
101x0x0
101x0x1
101x0xx
101x100
101x101
101x10x
101x110
101x111
101x11x
101x1x0
101x1x1
101x1xx
101xx00
101xx01
101xx0x
101xx10
101xx11
101xx1x
101xxx0
101xxx1
101xxxx
10x0000
10x0001
10x000x
10x0010
10x0011
10x001x
10x00x0
10x00x1
10x00xx
10x0100
10x0101
10x010x
10x0110
10x0111
10x011x
10x01x0
10x01x1
10x01xx
10x0x00
10x0x01
10x0x0x
10x0x10
10x0x11
10x0x1x
10x0xx0
10x0xx1
10x0xxx
10x1000
10x1001
10x100x
10x1010
10x1011
10x101x
10x10x0
10x10x1
10x10xx
10x1100
10x1101
10x110x
10x1110
10x1111
10x111x
10x11x0
10x11x1
10x11xx
10x1x00
10x1x01
10x1x0x
10x1x10
10x1x11
10x1x1x
10x1xx0
10x1xx1
10x1xxx
10xx000
10xx001
10xx00x
10xx010
10xx011
10xx01x
10xx0x0
10xx0x1
10xx0xx
10xx100
10xx101
10xx10x
10xx110
10xx111
10xx11x
10xx1x0
10xx1x1
10xx1xx
10xxx00
10xxx01
10xxx0x
10xxx10
10xxx11
10xxx1x
10xxxx0
10xxxx1
10xxxxx
1100000
1100001
110000x
1100010
1100011
110001x
11000x0
11000x1
11000xx
1100100
1100101
110010x
1100110
1100111
110011x
11001x0
11001x1
11001xx
1100x00
1100x01
1100x0x
1100x10
1100x11
1100x1x
1100xx0
1100xx1
1100xxx
1101000
1101001
110100x
1101010
1101011
110101x
11010x0
11010x1
11010xx
1101100
1101101
110110x
1101110
1101111
110111x
11011x0
11011x1
11011xx
1101x00
1101x01
1101x0x
1101x10
1101x11
1101x1x
1101xx0
1101xx1
1101xxx
110x000
110x001
110x00x
110x010
110x011
110x01x
110x0x0
110x0x1
110x0xx
110x100
110x101
110x10x
110x110
110x111
110x11x
110x1x0
110x1x1
110x1xx
110xx00
110xx01
110xx0x
110xx10
110xx11
110xx1x
110xxx0
110xxx1
110xxxx
1110000
1110001
111000x
1110010
1110011
111001x
11100x0
11100x1
11100xx
1110100
1110101
111010x
1110110
1110111
111011x
11101x0
11101x1
11101xx
1110x00
1110x01
1110x0x
1110x10
1110x11
1110x1x
1110xx0
1110xx1
1110xxx
1111000
1111001
111100x
1111010
1111011
111101x
11110x0
11110x1
11110xx
1111100
1111101
111110x
1111110
1111111
111111x
11111x0
11111x1
11111xx
1111x00
1111x01
1111x0x
1111x10
1111x11
1111x1x
1111xx0
1111xx1
1111xxx
111x000
111x001
111x00x
111x010
111x011
111x01x
111x0x0
111x0x1
111x0xx
111x100
111x101
111x10x
111x110
111x111
111x11x
111x1x0
111x1x1
111x1xx
111xx00
111xx01
111xx0x
111xx10
111xx11
111xx1x
111xxx0
111xxx1
111xxxx
11x0000
11x0001
11x000x
11x0010
11x0011
11x001x
11x00x0
11x00x1
11x00xx
11x0100
11x0101
11x010x
11x0110
11x0111
11x011x
11x01x0
11x01x1
11x01xx
11x0x00
11x0x01
11x0x0x
11x0x10
11x0x11
11x0x1x
11x0xx0
11x0xx1
11x0xxx
11x1000
11x1001
11x100x
11x1010
11x1011
11x101x
11x10x0
11x10x1
11x10xx
11x1100
11x1101
11x110x
11x1110
11x1111
11x111x
11x11x0
11x11x1
11x11xx
11x1x00
11x1x01
11x1x0x
11x1x10
11x1x11
11x1x1x
11x1xx0
11x1xx1
11x1xxx
11xx000
11xx001
11xx00x
11xx010
11xx011
11xx01x
11xx0x0
11xx0x1
11xx0xx
11xx100
11xx101
11xx10x
11xx110
11xx111
11xx11x
11xx1x0
11xx1x1
11xx1xx
11xxx00
11xxx01
11xxx0x
11xxx10
11xxx11
11xxx1x
11xxxx0
11xxxx1
11xxxxx
1x00000
1x00001
1x0000x
1x00010
1x00011
1x0001x
1x000x0
1x000x1
1x000xx
1x00100
1x00101
1x0010x
1x00110
1x00111
1x0011x
1x001x0
1x001x1
1x001xx
1x00x00
1x00x01
1x00x0x
1x00x10
1x00x11
1x00x1x
1x00xx0
1x00xx1
1x00xxx
1x01000
1x01001
1x0100x
1x01010
1x01011
1x0101x
1x010x0
1x010x1
1x010xx
1x01100
1x01101
1x0110x
1x01110
1x01111
1x0111x
1x011x0
1x011x1
1x011xx
1x01x00
1x01x01
1x01x0x
1x01x10
1x01x11
1x01x1x
1x01xx0
1x01xx1
1x01xxx
1x0x000
1x0x001
1x0x00x
1x0x010
1x0x011
1x0x01x
1x0x0x0
1x0x0x1
1x0x0xx
1x0x100
1x0x101
1x0x10x
1x0x110
1x0x111
1x0x11x
1x0x1x0
1x0x1x1
1x0x1xx
1x0xx00
1x0xx01
1x0xx0x
1x0xx10
1x0xx11
1x0xx1x
1x0xxx0
1x0xxx1
1x0xxxx
1x10000
1x10001
1x1000x
1x10010
1x10011
1x1001x
1x100x0
1x100x1
1x100xx
1x10100
1x10101
1x1010x
1x10110
1x10111
1x1011x
1x101x0
1x101x1
1x101xx
1x10x00
1x10x01
1x10x0x
1x10x10
1x10x11
1x10x1x
1x10xx0
1x10xx1
1x10xxx
1x11000
1x11001
1x1100x
1x11010
1x11011
1x1101x
1x110x0
1x110x1
1x110xx
1x11100
1x11101
1x1110x
1x11110
1x11111
1x1111x
1x111x0
1x111x1
1x111xx
1x11x00
1x11x01
1x11x0x
1x11x10
1x11x11
1x11x1x
1x11xx0
1x11xx1
1x11xxx
1x1x000
1x1x001
1x1x00x
1x1x010
1x1x011
1x1x01x
1x1x0x0
1x1x0x1
1x1x0xx
1x1x100
1x1x101
1x1x10x
1x1x110
1x1x111
1x1x11x
1x1x1x0
1x1x1x1
1x1x1xx
1x1xx00
1x1xx01
1x1xx0x
1x1xx10
1x1xx11
1x1xx1x
1x1xxx0
1x1xxx1
1x1xxxx
1xx0000
1xx0001
1xx000x
1xx0010
1xx0011
1xx001x
1xx00x0
1xx00x1
1xx00xx
1xx0100
1xx0101
1xx010x
1xx0110
1xx0111
1xx011x
1xx01x0
1xx01x1
1xx01xx
1xx0x00
1xx0x01
1xx0x0x
1xx0x10
1xx0x11
1xx0x1x
1xx0xx0
1xx0xx1
1xx0xxx
1xx1000
1xx1001
1xx100x
1xx1010
1xx1011
1xx101x
1xx10x0
1xx10x1
1xx10xx
1xx1100
1xx1101
1xx110x
1xx1110
1xx1111
1xx111x
1xx11x0
1xx11x1
1xx11xx
1xx1x00
1xx1x01
1xx1x0x
1xx1x10
1xx1x11
1xx1x1x
1xx1xx0
1xx1xx1
1xx1xxx
1xxx000
1xxx001
1xxx00x
1xxx010
1xxx011
1xxx01x
1xxx0x0
1xxx0x1
1xxx0xx
1xxx100
1xxx101
1xxx10x
1xxx110
1xxx111
1xxx11x
1xxx1x0
1xxx1x1
1xxx1xx
1xxxx00
1xxxx01
1xxxx0x
1xxxx10
1xxxx11
1xxxx1x
1xxxxx0
1xxxxx1
1xxxxxx
x000000
x000001
x00000x
x000010
x000011
x00001x
x0000x0
x0000x1
x0000xx
x000100
x000101
x00010x
x000110
x000111
x00011x
x0001x0
x0001x1
x0001xx
x000x00
x000x01
x000x0x
x000x10
x000x11
x000x1x
x000xx0
x000xx1
x000xxx
x001000
x001001
x00100x
x001010
x001011
x00101x
x0010x0
x0010x1
x0010xx
x001100
x001101
x00110x
x001110
x001111
x00111x
x0011x0
x0011x1
x0011xx
x001x00
x001x01
x001x0x
x001x10
x001x11
x001x1x
x001xx0
x001xx1
x001xxx
x00x000
x00x001
x00x00x
x00x010
x00x011
x00x01x
x00x0x0
x00x0x1
x00x0xx
x00x100
x00x101
x00x10x
x00x110
x00x111
x00x11x
x00x1x0
x00x1x1
x00x1xx
x00xx00
x00xx01
x00xx0x
x00xx10
x00xx11
x00xx1x
x00xxx0
x00xxx1
x00xxxx
x010000
x010001
x01000x
x010010
x010011
x01001x
x0100x0
x0100x1
x0100xx
x010100
x010101
x01010x
x010110
x010111
x01011x
x0101x0
x0101x1
x0101xx
x010x00
x010x01
x010x0x
x010x10
x010x11
x010x1x
x010xx0
x010xx1
x010xxx
x011000
x011001
x01100x
x011010
x011011
x01101x
x0110x0
x0110x1
x0110xx
x011100
x011101
x01110x
x011110
x011111
x01111x
x0111x0
x0111x1
x0111xx
x011x00
x011x01
x011x0x
x011x10
x011x11
x011x1x
x011xx0
x011xx1
x011xxx
x01x000
x01x001
x01x00x
x01x010
x01x011
x01x01x
x01x0x0
x01x0x1
x01x0xx
x01x100
x01x101
x01x10x
x01x110
x01x111
x01x11x
x01x1x0
x01x1x1
x01x1xx
x01xx00
x01xx01
x01xx0x
x01xx10
x01xx11
x01xx1x
x01xxx0
x01xxx1
x01xxxx
x0x0000
x0x0001
x0x000x
x0x0010
x0x0011
x0x001x
x0x00x0
x0x00x1
x0x00xx
x0x0100
x0x0101
x0x010x
x0x0110
x0x0111
x0x011x
x0x01x0
x0x01x1
x0x01xx
x0x0x00
x0x0x01
x0x0x0x
x0x0x10
x0x0x11
x0x0x1x
x0x0xx0
x0x0xx1
x0x0xxx
x0x1000
x0x1001
x0x100x
x0x1010
x0x1011
x0x101x
x0x10x0
x0x10x1
x0x10xx
x0x1100
x0x1101
x0x110x
x0x1110
x0x1111
x0x111x
x0x11x0
x0x11x1
x0x11xx
x0x1x00
x0x1x01
x0x1x0x
x0x1x10
x0x1x11
x0x1x1x
x0x1xx0
x0x1xx1
x0x1xxx
x0xx000
x0xx001
x0xx00x
x0xx010
x0xx011
x0xx01x
x0xx0x0
x0xx0x1
x0xx0xx
x0xx100
x0xx101
x0xx10x
x0xx110
x0xx111
x0xx11x
x0xx1x0
x0xx1x1
x0xx1xx
x0xxx00
x0xxx01
x0xxx0x
x0xxx10
x0xxx11
x0xxx1x
x0xxxx0
x0xxxx1
x0xxxxx
x100000
x100001
x10000x
x100010
x100011
x10001x
x1000x0
x1000x1
x1000xx
x100100
x100101
x10010x
x100110
x100111
x10011x
x1001x0
x1001x1
x1001xx
x100x00
x100x01
x100x0x
x100x10
x100x11
x100x1x
x100xx0
x100xx1
x100xxx
x101000
x101001
x10100x
x101010
x101011
x10101x
x1010x0
x1010x1
x1010xx
x101100
x101101
x10110x
x101110
x101111
x10111x
x1011x0
x1011x1
x1011xx
x101x00
x101x01
x101x0x
x101x10
x101x11
x101x1x
x101xx0
x101xx1
x101xxx
x10x000
x10x001
x10x00x
x10x010
x10x011
x10x01x
x10x0x0
x10x0x1
x10x0xx
x10x100
x10x101
x10x10x
x10x110
x10x111
x10x11x
x10x1x0
x10x1x1
x10x1xx
x10xx00
x10xx01
x10xx0x
x10xx10
x10xx11
x10xx1x
x10xxx0
x10xxx1
x10xxxx
x110000
x110001
x11000x
x110010
x110011
x11001x
x1100x0
x1100x1
x1100xx
x110100
x110101
x11010x
x110110
x110111
x11011x
x1101x0
x1101x1
x1101xx
x110x00
x110x01
x110x0x
x110x10
x110x11
x110x1x
x110xx0
x110xx1
x110xxx
x111000
x111001
x11100x
x111010
x111011
x11101x
x1110x0
x1110x1
x1110xx
x111100
x111101
x11110x
x111110
x111111
x11111x
x1111x0
x1111x1
x1111xx
x111x00
x111x01
x111x0x
x111x10
x111x11
x111x1x
x111xx0
x111xx1
x111xxx
x11x000
x11x001
x11x00x
x11x010
x11x011
x11x01x
x11x0x0
x11x0x1
x11x0xx
x11x100
x11x101
x11x10x
x11x110
x11x111
x11x11x
x11x1x0
x11x1x1
x11x1xx
x11xx00
x11xx01
x11xx0x
x11xx10
x11xx11
x11xx1x
x11xxx0
x11xxx1
x11xxxx
x1x0000
x1x0001
x1x000x
x1x0010
x1x0011
x1x001x
x1x00x0
x1x00x1
x1x00xx
x1x0100
x1x0101
x1x010x
x1x0110
x1x0111
x1x011x
x1x01x0
x1x01x1
x1x01xx
x1x0x00
x1x0x01
x1x0x0x
x1x0x10
x1x0x11
x1x0x1x
x1x0xx0
x1x0xx1
x1x0xxx
x1x1000
x1x1001
x1x100x
x1x1010
x1x1011
x1x101x
x1x10x0
x1x10x1
x1x10xx
x1x1100
x1x1101
x1x110x
x1x1110
x1x1111
x1x111x
x1x11x0
x1x11x1
x1x11xx
x1x1x00
x1x1x01
x1x1x0x
x1x1x10
x1x1x11
x1x1x1x
x1x1xx0
x1x1xx1
x1x1xxx
x1xx000
x1xx001
x1xx00x
x1xx010
x1xx011
x1xx01x
x1xx0x0
x1xx0x1
x1xx0xx
x1xx100
x1xx101
x1xx10x
x1xx110
x1xx111
x1xx11x
x1xx1x0
x1xx1x1
x1xx1xx
x1xxx00
x1xxx01
x1xxx0x
x1xxx10
x1xxx11
x1xxx1x
x1xxxx0
x1xxxx1
x1xxxxx
xx00000
xx00001
xx0000x
xx00010
xx00011
xx0001x
xx000x0
xx000x1
xx000xx
xx00100
xx00101
xx0010x
xx00110
xx00111
xx0011x
xx001x0
xx001x1
xx001xx
xx00x00
xx00x01
xx00x0x
xx00x10
xx00x11
xx00x1x
xx00xx0
xx00xx1
xx00xxx
xx01000
xx01001
xx0100x
xx01010
xx01011
xx0101x
xx010x0
xx010x1
xx010xx
xx01100
xx01101
xx0110x
xx01110
xx01111
xx0111x
xx011x0
xx011x1
xx011xx
xx01x00
xx01x01
xx01x0x
xx01x10
xx01x11
xx01x1x
xx01xx0
xx01xx1
xx01xxx
xx0x000
xx0x001
xx0x00x
xx0x010
xx0x011
xx0x01x
xx0x0x0
xx0x0x1
xx0x0xx
xx0x100
xx0x101
xx0x10x
xx0x110
xx0x111
xx0x11x
xx0x1x0
xx0x1x1
xx0x1xx
xx0xx00
xx0xx01
xx0xx0x
xx0xx10
xx0xx11
xx0xx1x
xx0xxx0
xx0xxx1
xx0xxxx
xx10000
xx10001
xx1000x
xx10010
xx10011
xx1001x
xx100x0
xx100x1
xx100xx
xx10100
xx10101
xx1010x
xx10110
xx10111
xx1011x
xx101x0
xx101x1
xx101xx
xx10x00
xx10x01
xx10x0x
xx10x10
xx10x11
xx10x1x
xx10xx0
xx10xx1
xx10xxx
xx11000
xx11001
xx1100x
xx11010
xx11011
xx1101x
xx110x0
xx110x1
xx110xx
xx11100
xx11101
xx1110x
xx11110
xx11111
xx1111x
xx111x0
xx111x1
xx111xx
xx11x00
xx11x01
xx11x0x
xx11x10
xx11x11
xx11x1x
xx11xx0
xx11xx1
xx11xxx
xx1x000
xx1x001
xx1x00x
xx1x010
xx1x011
xx1x01x
xx1x0x0
xx1x0x1
xx1x0xx
xx1x100
xx1x101
xx1x10x
xx1x110
xx1x111
xx1x11x
xx1x1x0
xx1x1x1
xx1x1xx
xx1xx00
xx1xx01
xx1xx0x
xx1xx10
xx1xx11
xx1xx1x
xx1xxx0
xx1xxx1
xx1xxxx
xxx0000
xxx0001
xxx000x
xxx0010
xxx0011
xxx001x
xxx00x0
xxx00x1
xxx00xx
xxx0100
xxx0101
xxx010x
xxx0110
xxx0111
xxx011x
xxx01x0
xxx01x1
xxx01xx
xxx0x00
xxx0x01
xxx0x0x
xxx0x10
xxx0x11
xxx0x1x
xxx0xx0
xxx0xx1
xxx0xxx
xxx1000
xxx1001
xxx100x
xxx1010
xxx1011
xxx101x
xxx10x0
xxx10x1
xxx10xx
xxx1100
xxx1101
xxx110x
xxx1110
xxx1111
xxx111x
xxx11x0
xxx11x1
xxx11xx
xxx1x00
xxx1x01
xxx1x0x
xxx1x10
xxx1x11
xxx1x1x
xxx1xx0
xxx1xx1
xxx1xxx
xxxx000
xxxx001
xxxx00x
xxxx010
xxxx011
xxxx01x
xxxx0x0
xxxx0x1
xxxx0xx
xxxx100
xxxx101
xxxx10x
xxxx110
xxxx111
xxxx11x
xxxx1x0
xxxx1x1
xxxx1xx
xxxxx00
xxxxx01
xxxxx0x
xxxxx10
xxxxx11
xxxxx1x
xxxxxx0
xxxxxx1
xxxxxxx
